In [3]:
import pandas as pd

In [4]:
import numpy as np

In [ ]:
 en Pandas
numeros = [3, 4 , 5, 6, 7, 8]
serie = pd.Series(numeros)
serie, type(serie)

In [4]:
#Data frame
data = {
  "Nombre":["Ana", "Juan", "Pedro", "María", "Luis"],
  "Edad":[22, 25, 28, 23, 20],
  "Ciudad":["Barcelona", "Caracas", "Madrid", "Santiago de Chile", "Buenos Aires"]
}
data, type(data)

({'Nombre': ['Ana', 'Juan', 'Pedro', 'María', 'Luis'],
  'Edad': [22, 25, 28, 23, 20],
  'Ciudad': ['Barcelona',
   'Caracas',
   'Madrid',
   'Santiago de Chile',
   'Buenos Aires']},
 dict)

In [5]:
#Generar el data frame a partir el diccionario anterior
df = pd.DataFrame(data=data)
df

  Nombre  Edad             Ciudad
0    Ana    22          Barcelona
1   Juan    25            Caracas
2  Pedro    28             Madrid
3  María    23  Santiago de Chile
4   Luis    20       Buenos Aires

In [6]:
#Exportar un dataFrame
df.to_csv("dataf.csv")

In [8]:
#Importar un dataFrame
import_df = pd.read_csv("dataf.csv", index_col=0)
import_df

  Nombre  Edad             Ciudad
0    Ana    22          Barcelona
1   Juan    25            Caracas
2  Pedro    28             Madrid
3  María    23  Santiago de Chile
4   Luis    20       Buenos Aires

In [9]:
#Seleccionar una columna
nombres = df["Nombre"]
nombres

0      Ana
1     Juan
2    Pedro
3    María
4     Luis
Name: Nombre, dtype: object

In [10]:
#Seleccionar varias columnas
df[["Nombre", "Edad"]]

  Nombre  Edad
0    Ana    22
1   Juan    25
2  Pedro    28
3  María    23
4   Luis    20

In [12]:
#Filtrar por índice
fila = df.loc[2]
fila

Nombre     Pedro
Edad          28
Ciudad    Madrid
Name: 2, dtype: object

In [13]:
#Filtrar por condiciones, seleccionar mayores de 23 años
df[df["Edad"] > 23]

  Nombre  Edad   Ciudad
1   Juan    25  Caracas
2  Pedro    28   Madrid

In [15]:
filtro = (df["Edad"] > 23) & (df["Nombre"].str.startswith("P"))
df[filtro]

  Nombre  Edad  Ciudad
2  Pedro    28  Madrid

In [16]:
#Filtrar personas mayores de 23 años mediante Query
df.query("Edad > 23")

  Nombre  Edad   Ciudad
1   Juan    25  Caracas
2  Pedro    28   Madrid

In [17]:
#Extraer la información de varios elementos
df[df["Nombre"].isin(["Ana", "Carlos", "Luis"])]

  Nombre  Edad        Ciudad
0    Ana    22     Barcelona
4   Luis    20  Buenos Aires

In [20]:
#Funciones a los filtros realizados
def longitud_5(nombre):
  return len(nombre) == 5

df[df["Nombre"].apply(longitud_5)]

  Nombre  Edad             Ciudad
2  Pedro    28             Madrid
3  María    23  Santiago de Chile

In [21]:
#Filtrar por edades entre 25 a 35 años (inclisivo) con junto cerrado
df[df["Edad"].between(25, 35)]

  Nombre  Edad   Ciudad
1   Juan    25  Caracas
2  Pedro    28   Madrid

In [41]:
data = {
  "Nombre":["Ana", "Juan", "Pedro", "María", "Luis", "Miguel"],
  "Edad":[22, 25, 28, np.nan, 23, 20],
  "Ciudad":["Barcelona", "Caracas", None, "Santiago de Chile", "Buenos Aires", "Berlín"]
}

df = pd.DataFrame(data)
df

   Nombre  Edad             Ciudad
0     Ana  22.0          Barcelona
1    Juan  25.0            Caracas
2   Pedro  28.0               None
3   María   NaN  Santiago de Chile
4    Luis  23.0       Buenos Aires
5  Miguel  20.0             Berlín

In [47]:
#Rellenar los valores faltantes
promedio_edad = df["Edad"].mean()
print(promedio_edad)

df_fill = df.fillna(
  {
    "Edad" : df["Edad"].mean(),
    "Ciudad": "Desconocido"
  }
)

df_fill

23.6

   Nombre  Edad             Ciudad
0     Ana  22.0          Barcelona
1    Juan  25.0            Caracas
2   Pedro  28.0        Desconocido
3   María  23.6  Santiago de Chile
4    Luis  23.0       Buenos Aires
5  Miguel  20.0             Berlín

In [48]:
#Eliminar filas con valores nulos o faltantes
df_sin_nan = df.dropna()
df_sin_nan

   Nombre  Edad        Ciudad
0     Ana  22.0     Barcelona
1    Juan  25.0       Caracas
4    Luis  23.0  Buenos Aires
5  Miguel  20.0        Berlín

In [54]:
# Reemplazar valores específicos de alguna columna
df_reem = df.replace(
  {
    "Ciudad": {None: "Desconocido"},
    "Edad": {np.nan: "Datos no compartidos"}
  }
)
df_reem

   Nombre                  Edad             Ciudad
0     Ana                  22.0          Barcelona
1    Juan                  25.0            Caracas
2   Pedro                  28.0        Desconocido
3   María  Datos no compartidos  Santiago de Chile
4    Luis                  23.0       Buenos Aires
5  Miguel                  20.0             Berlín

In [56]:
# Interpolar valores
df_interpolado = df.copy()
df_interpolado["Edad"] = df["Edad"].interpolate()
df_interpolado

   Nombre  Edad             Ciudad
0     Ana  22.0          Barcelona
1    Juan  25.0            Caracas
2   Pedro  28.0               None
3   María  25.5  Santiago de Chile
4    Luis  23.0       Buenos Aires
5  Miguel  20.0             Berlín

In [5]:
data_duplicada = {
  "Nombre":["Ana", "Ana"],
  "Edad":[22, 22],
  "Ciudad":["Barcelona", "Barcelona"]
}

df_duplicado = pd.DataFrame(data_duplicada)
df_duplicado

  Nombre  Edad     Ciudad
0    Ana    22  Barcelona
1    Ana    22  Barcelona

In [6]:
df_sin_duplicados = df_duplicado.drop_duplicates()
df_sin_duplicados

  Nombre  Edad     Ciudad
0    Ana    22  Barcelona

In [9]:
#Renombrar columnas de un dataframe
df_renombrado = df_duplicado.rename(columns={"Nombre":"Name", "Edad":"Age", "Ciudad":"City"})
df_renombrado

  Name  Age       City
0  Ana   22  Barcelona
1  Ana   22  Barcelona

In [11]:
#Ordenar columnas de un dataframe
columnas_ordenadas = ["Ciudad", "Edad", "Nombre"]
df_ordenado = df_duplicado[columnas_ordenadas]
df_ordenado

      Ciudad  Edad Nombre
0  Barcelona    22    Ana
1  Barcelona    22    Ana

In [12]:
#Transformación de datos, supongamos la elevación al cuadrado de la edad
def cuadrado(x):
  return x**2

df_duplicado["Edad Cuadrado"] = df_duplicado["Edad"].apply(cuadrado)
df_duplicado

  Nombre  Edad     Ciudad  Edad Cuadrado
0    Ana    22  Barcelona            484
1    Ana    22  Barcelona            484